# 1 version
s = 'Было просто пасмурно, дуло с севера А к обеду насчитал сто градаций серого Так всегда первого ноль девятого То ли весь мир сошёл с ума, то ли я - тогоНа столе записка от неё смятая Недопитый виски допиваю с матами Посмотрю в окно, допишу главу Первое сентября, дворник жжёт листву Серым облакам наплевать на нас Если знаешь как жить - живи Ты хотела плыть как все - так плыви!'
s = s.split()

def splitting_str(s):
    five_length = []
    for word in s:
        if len(word) < 5:
            five_length.append(word)
    return(five_length) 

print(splitting_str(s))

'''
# 2 version
s = 'Было просто пасмурно, дуло с севера А к обеду насчитал сто градаций серого Так всегда первого ноль девятого То ли весь мир сошёл с ума, то ли я - тогоНа столе записка от неё смятая Недопитый виски допиваю с матами Посмотрю в окно, допишу главу Первое сентября, дворник жжёт листву Серым облакам наплевать на нас Если знаешь как жить - живи Ты хотела плыть как все - так плыви!'
s = s.split()

def splitting_str(s):
    five_length = [word for word in s if len(word) < 5]
    return five_length
    
print(splitting_str(s))
'''