'''
2. Длина МКАД – 109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью 𝑣 километров в час. 
На какой отметке он остановится через 𝑡 часов? Значения скорости и времени считаются целыми числами.
'''

V = int(input('Скорость байка (км/ч): '))
S = 109 #км/ч
t = int(input('Через сколько часов байк остановится: '))
stop_point = V * t

# случаи, если байк поедет в обратную сторону от нуля и обратно
if stop_point < 109: 
   print('Спустя', t, 'ч. байк остановится на', stop_point, 'км')
else:
   print('Спустя', t, 'ч. байк будет на', stop_point - 109, 'км')
